import { Container } from "react-bootstrap";

function JsBlog(){
    return(
        <>
        <h1>Javascript Blog</h1>
        <Container>
            <p style={{textAlign : 'justify'}}>
            ممکن است این سؤال در ذهن کاربر مطرح شود که دقیقاً نقش جاوا اسکریپت چیست و آیا بدون جاوا اسکریپت وب به معنای امروزی وجود خواهد داشت. بدون وجود جاوا اسکریپت، تنها عناصر موجود در وب HTML و CSS خواهند بود. با این وجود در بیش از 90 درصد موارد، صفحات ساخته شده با این دو عنصر، صفحاتی ایستا و ثابت خواهند بود. تنها تغییراتی که در این‌گونه موارد کاربران مشاهده می‌کنند، شاید تغییرات انیمیشن‌های CSS باشد. به صورت کلی می‌توان گفت که HTML و CSS جسم صفحات وب و جاوا اسکریپت روح آن‌ها است.

            به صورت کلی، HTML در ساختار صفحه وب، محتوای آن را تعریف می‌کند. CSS سبک‌های مختلفی را برای محتویات ارائه شده در صفحه وب تعریف می‌کند و به آن استایل می‌دهد. HTML و CSS اغلب به جای زبان‌های برنامه نویسی، «زبان‌های نشانه‌گذاری» (Markup Language) نامیده می‌شوند. برخلاف دو عنصر قبلی، ماهیت جاوا اسکریپت متفاوت است و از آن به‌ عنوان زبان برنامه نویسی یاد می‌شود. این زبان برنامه نویسی از محاسبات ریاضی پشتیبانی می‌کند و به کاربران این امکان را می‌دهد که به صورت پویا محتویات HTML را به DOM اضافه کنند، اعلان پویا ایجاد کنند، محتوا را از وب‌سایت‌های دیگر واکشی کنند و بسیاری از موارد دیگر را انجام دهند.
            </p>
        </Container>
        </>
    )
}
export default JsBlog