import { Container } from "react-bootstrap";

function PhpBlog(){
    return(
        <>
        <h1>PHP BLOG</h1>
        <Container>
            <p style={{textAlign : 'justify'}}>در اینجا میخواهیم یک معرفی بسیار کلی از PHP داشته باشیم که بصورت مبتدی متوجه شویم که PHP چیست؟

            PHP مخفف PHP Hypertext Preprocessor است که PHP یک اسم خاص در آن می‌باشد.
            PHP یک زبان برنامه نویسی یا اسکریپت نویسی اپن سورس (Open Source) است. به این معنا که استفاده از PHP کاملا رایگان است و شما هیچ هزینه‌ای برای کار با آن پرداخت نمیکنید.
            کدهای PHP باید روی یک سرور اجرا شوند. این سرور میتواند یک سرور واقعی باشد و یا سرور موجود در کامپیوتر شما (با استفاده از نرم افزارهایی مثل wamp یا xampp)
            PHP در بسیاری از سایت های بزرگ جهان استفاده شده و کاربردی جهانی دارد.
            این مقدماتی بود که نیاز بود درباره‌ی PHP بدانیم تا بهتر بتوانیم به سوال PHP چیست؟ پاسخ دهیم. در ادامه میخواهیم بصورت ریز تر و جزئی تر به سوال PHP چیست؟ پاسخ دهیم.

            قبل از مطالعه‌ی این مقاله، مقاله‌ی Back End چیست و به چه کسی برنامه نویس بک اند میگویند؟ نیز میتواند بسیار مفید باشد.

            

            PHP دقیقا چه کار میکند؟
            PHP یک زبان برنامه نویسی است که میتوانیم با استفاده از آن اقدام به ساخت صفحات وب داینامیک (Dynamic) کنیم. درباره‌ی صفحات وب داینامیک در ادامه‌ی این مقاله صحبت خواهیم کرد.

            مقاله‌ی مرتبط: چگونه وجود یا عدم وجود ایمیل کاربران در دیتابیس را چک کنیم؟
            با استفاده از PHP میتوانیم سایت و اپلیکیشن های تحت وب قدرتمندی را برنامه نویسی کنیم. اگر بخواهیم ریزتر به سوال PHP چیست؟ پاسخ دهیم، باید بگوییم که PHP کارهای پشت صحنه را در صفحات وب انجام میدهد.

            </p>
        </Container>
        </>
    )
}
export default PhpBlog