import { Container } from "react-bootstrap";

function ReactBlog(){
    return(
        <>
        <h1>React Blog</h1>
        <Container>
            <p style={{textAlign : 'justify'}}>
            React js یکی از کتابخانه های جاوا اسکریپت است که open source است. برنامه نویسان فرانت اند برای ساخت ui و صفحات وب اپلیکیشن های تک صفحه ای استفاده می کنند. قبل از یادگیری react شما باید حداقل آشنایی لازم را با جاوا اسکریپت داشته باشید. پویایی المنت های صفحات وب به خاطر استفاده از جاوا اسکریپت و یا کتابخانه های آن است. کتابخانه های javascript کدهای آماده ای هستند که با جاوا اسکریپت توسعه داده شده اند.

            و برنامه نویسیان بیشتر از کتابخانه های زبان جاوا اسکریپت استفاده می کنند. به این دلیل که کد ها آماده هستند و برنامه نوشتن با آن سریعتر پیش می رود. کد های آماده شامل کامپوننت های آماده، توابع و الگوهای از پیش تعیین شده هستند. 

            کتابخانه ری اکت در زمینه مدیریت لایه در وب سایت نیز استفاده های بسیار زیادی را پوشش می دهد. همچنین ری اکت این امکان را در اختیار کاربر قرار می‌دهد تا کامپوننت هایی که با استفاده از آن می توان قابلیت استفاده مجدد را در رابطه کاربری ایجاد نمود تهیه نماییم.

            تاریخچه پیدایش reactjs به سال ۲۰۱۱ باز می گردد که فردی به نام جردن و بالک به عنوان یکی از مهندسین ارشد که در شرکت فیس بوک در حال فعالیت بود آن را معرفی کرده و در نهایت این کتابخانه در سال ۲۰۱۲ در اپلیکیشن اجتماعی بسیار معروف اینستاگرام مورد استفاده قرار گرفت.
            </p>
        </Container>
        </>
    )
}
export default ReactBlog